[
  {
    "name": "bouncy",
    "displayName": "Bouncy",
    "subTitle": "Bouncy the Wouncy.",
    "about": "About - Bouncy is a member of Flap's main family, 'The Hoppy Family', so called as the mother of the family is Hoppy. Bouncy is one of Flap's biggest characters. She was in the very first Flap in the story, 'Hoppy the Toppy and Bouncy the Wouncy.' Look, it rhymed, ok! Later, the story was reduced to Hoppy and Bouncy. Fair enough methinks!",
    "family": "Family - As already stated, Bouncy is a member of 'The Hoppy Family.' She is the youngest daughter of Hoppy and Plush. Her older sisters are Lucy and Cabbit and her younger brothers are Nick, Puppy and Phill.",
    "other": "Any reason for his name? Well, I suppose so. She's a Blackpool lass! She was bought in shop in Blackpool. But, looking at her, she looks very much like a mouse...and we even thought so at the time, but her tail was a short stump, so we made her a rabbit. (looking back now, I think shes a mouse, but never mind...a rabbit she will remain!) So, after deciding she was a rabbit, and the name Hoppy had already gone (because rabbits hop) we decided on Bouncy. (cos they also bounce!)",
    "appearances": [
      {
        "strip": "Hoppy and Bouncy"
      },
      {
        "strip": "Bouncy Brilliant"
      },
      {
        "strip": "The Hoppy Family"
      }
    ]
  },
  {
    "name": "cabbit",
    "displayName": "Cabbit",
    "subTitle": "Hoppy the Rabbit, Sabbit, Babbit and Cabbit.",
    "about": "About - Cabbit is a member of Flap's main family, 'The Hoppy Family', so called as the mother of the family is Hoppy. Cabbit however has hardly featured at all in Flap and never really got into the spotlight. She starred in her own comic strip 'Cabbit the Rabbit' although it was never a hit and the strip only appeared once. She came into the spotlight more in the later issues of Flap as the strip , 'The Hoppy Family' was introduced. She also featured in a one off story called, 'Hoppy the Rabbit, Sabbit, Babbit and Cabbit,' where hoppy was again the mother, and the 3 youngsters were girls! Much like the Dandy's very own 'Korky the Cat, Nip, Lip and Rip'",
    "family": "Family - As already stated, Cabbit is a member of 'The Hoppy Family.' (whose surname used to be 'Nation' but that just doesnt make sense now, so that's scrapped!!!) She is the eldest offspring of Hoppy and Plush. Her younger sisters are Lucy and Bouncy and her even younger brothers are Nick, Puppy and Phill.",
    "other": "Cabbit is based on a soft toy that I won in a trampoline competition, though she was already ragged and hence she was never a favourite.",
    "appearances": [
      {
        "strip": "Cabbit the Rabbit"
      },
      {
        "strip": "Hoppy the Rabbit, Sabbit, Babbit & Cabbit"
      },
      {
        "strip": "The Hoppy Family"
      }
    ]
  },
  {
    "name": "nick",
    "displayName": "Nicky",
    "subTitle": "Young Nick.",
    "about": "About - Nick is the 'main' Flap Character, he's the Dennis the Menace of Flap. His character is much like Dennis, such was the influence of the Beano. Nick is known for bullying his younger brother 'Puppy' (or Michael), the Softy Walter of Flap and for hanging around with his mates, James and Sid. Nick's favourite toy is a Pogo Stick and he enjoys teasing his mother (Hoppy) Although he is always in trouble when his Dad, Plush gets home from work. Any reason for his name? My bestfriend at Primary School was called Nicky, and hence my favourite soft toy was named Nicky.  Don't ask me why he's 100% Dog, when his mother is 100% Rabbit. He should be half rabbit by all means, but no, he's a full dog...such was the ignorance of childhood! :-)  Nick usually appears on the front page of 'The Flap' in Flap's main story, 'Young Nick.' Although Nick was very much my favourite and hence, he had a ton of other stories either shared, or all to himself.",
    "family": "Family - Mother = Hoppy, Father = Plush. Older Sisters, Cabbit, Lucy, Bouncy. Younger Brothers, Puppy, Phill",
    "other": "",
    "appearances": [
      {
        "strip": "Young Nick"
      },
      {
        "strip": "Nicky and Sid"
      },
      {
        "strip": "Space Adventures of Nick & James"
      },
      {
        "strip": "Nicky at the PGL"
      },
      {
        "strip": "The Hoppy Family"
      },
      {
        "strip": "Midge Busters"
      },
      {
        "strip": "Jitsu Kids"
      },
      {
        "strip": "Boos Boardy & Nicks Deck"
      },
      {
        "strip": "Lightning Dogs"
      }
    ]
  },
  {
    "name": "phill",
    "displayName": "Phill",
    "subTitle": "Phii a Ga'in",
    "about": "About - Phill is the youngest member of Flap's main family (referred to as The Hoppy Family). He was brought into Flap relatively late, yet he quickly became a key character and well liked. He is very young and on birth...for some unknown bizarre reason...the first person he saw was Flap star Gavin. Hence, Phill tends to copy Gavin's every move and he's his idol. Though quite what Gavin was doing at the birth of Phill is a mystery. Thus came a natural attraction to Gavin's younger sister Georgia, even though Phill is way too young to be bothered about romance. Phill's older brother, Puppy, known for his softness, has tried many of times to take advantage over the fact that he is no longer the youngest family member, but Phill is always up to the challenge and he never lets Puppy intimidate him. In his first appearances, Phill appeared very odd in colour. Infact, he had an orange face with yellow ears and a red mouth and chin. His character was introduced before the soft toy later named 'Phill' was purchased, hence, he quickly changed colour when the 'real' Phill emerged. The crafty Flap editors turned it into a storyline of Phill steeling and using Make-up from his mother!! Any reason for his name? Phill was purchased quite late in my childhood...hence his late arrival into Flap, but as far as the name Phill goes...no, it's just a name.",
    "family": "Family - Mother = Hoppy, Father = Plush. Older Sisters, Cabbit, Lucy, Bouncy. Older Brothers, Nick, Puppy",
    "other": "",
    "appearances": [
      {
        "strip": "Phill"
      },
      {
        "strip": "The Hoppy Family"
      }
    ]
  },
  {
    "name": "puppy",
    "displayName": "Puppy",
    "subTitle": "Blub",
    "about": "About - Puppy did not appear in the very first Flap, yet he is still an important character. Yet another offspring of Plush and Hoppy Puppys actual name is Michael but has never been refered to as such in Flap. He is quite an emotional character with a whimperish voice, and is forever on the wrong end of older brother, Nick's tricks. Puppy is Flap's Walter the Softy, and gets up to very much the same as Walter would. His friend Softy Simpkins, who has never been a regular character, is as soft as he is, and they are best friends. Also, Sam, who is no softy, feels sorry for Puppy and is not a fan of Nick's bullying. Any reason for his name? Puppy is called puppy because, again, he is based on a soft toy. However, he is so tiny, that he is just like a puppy. Hence, he is called Puppy. Although, later on in life, he was given the name Michael as I realised he can't be called Puppy after his younger brother, Phill, (also a dog) was introduced.",
    "family": "Family - Mother = Hoppy, Father = Plush. Older Sisters, Cabbit, Lucy, Bouncy. Older Brother, Nick, Younger Brothers,Phill",
    "other": "",
    "appearances": [
      {
        "strip": "Little Puppy"
      },
      {
        "strip": "The Hoppy Family"
      },
      {
        "strip": "Puppy's Payless"
      },
      {
        "strip": "Jitsu Kids"
      }
    ]
  },
  {
    "name": "sid",
    "displayName": "Sid",
    "subTitle": "",
    "about": "About - Sid is one of the oldest Flap characters. He was in the very first issue of Flap, and he also featured on the front page along with Flap star Nick, in 'Nicky and Sid'. They went roller skating in their very first adventure. Sid is one of Nick's best mates, along with James.",
    "family": "Family - Sid has a sister called Joanne and together they star in the strip 'Sid and Joanne' where they constantly try and get the better over one another. Sid's dad is Bozwell",
    "other": "Any reason for his name? Not that I can think of!! I didnt know anyone called Sid, so this characters name is completely irrelevent to anything. Sid is based on a soft toy that I was given as a present, at the same time i recieved Puppy and Joanne",
    "appearances": [
      {
        "strip": "Nicky and Sid"
      },
      {
        "strip": "Midge Busters"
      },
      {
        "strip": "Sid"
      },
      {
        "strip": "Jitsu Kids"
      },
      {
        "strip": "Sid and Joanne"
      },
      {
        "strip": "Sid's Fireworks"
      }
    ]
  }
]
